srv/Enums/ТипыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Конфигурация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВеткаМетаданных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подсистема</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщийМодуль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПараметрСеанса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Роль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланОбмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КритерийОтбора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодпискаНаСобытия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегламентноеЗадание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Форма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интерфейс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Макет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Картинка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПакетXDTO</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WebСервис</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WSСсылка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стиль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлементСтиля</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Язык</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЖурналДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перечисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланВидовХарактеристик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланСчетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланВидовРасчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрНакопления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрБухгалтерии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрРасчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БизнесПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Константа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Справочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реквизит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТабличнаяЧасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Модуль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Графа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Измерение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ресурс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Значение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщийМакет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщаяФорма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Формы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТабличныеЧасти</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФункциональнаяОпция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ХранилищеНастроек</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщаяКоманда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГруппаКоманд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправляемаяФорма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщаяУправляемаяФорма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПараметрФункциональнойОпции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОпределяемыйТип</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтандартныйРеквизит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщийРеквизит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Команда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредопределенныйЭлемент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтандартнаяТабличнаяЧасть</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

srv/CommonModules/ОбщегоНазначениеСервер/Ext/Module.bsl
Процедура ЗаписатьИнформациюВЖурнал(ИмяСобытия ,Сообщение, Уровень) Экспорт 
	
	ЗаписьЖурналаРегистрации("ЛогОтладка", ПредопределенноеЗначение("УровеньЖурналаРегистрации."+Уровень),,,Сообщение);
	
КонецПроцедуры	


// Возвращает таблицу значений с типами объектов.
//
Функция ЗаполнитьТаблицуТиповОбъектов() Экспорт
	
	ПеречисленияТипы = Перечисления.ТипыОбъектов;
	
	ТипыОбъектов = Новый ТаблицаЗначений();
	ТипыОбъектов.Колонки.Добавить("ИмяВЕдинственномЧисле");
	ТипыОбъектов.Колонки.Добавить("ИмяВоМножественномЧисле");
	ТипыОбъектов.Колонки.Добавить("Родитель");
	ТипыОбъектов.Колонки.Добавить("ПеречислениеТип");
	ТипыОбъектов.Колонки.Добавить("ИндексКартинки");	
	
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "Конфигурация",					"Конфигурации", 				"", 			ПеречисленияТипы.Конфигурация, 					0);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "Общие",						"Общие", 						"Конфигурация", ПеречисленияТипы.ВеткаМетаданных, 				1);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "Подсистема",					"Подсистемы", 					"Общие", 		ПеречисленияТипы.Подсистема, 					2);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "ОбщийМодуль",					"ОбщиеМодули", 					"Общие", 		ПеречисленияТипы.ОбщийМодуль, 					3);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "ПараметрСеанса",				"ПараметрыСеанса", 				"Общие", 		ПеречисленияТипы.ПараметрСеанса, 				4);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "Роль",							"Роли", 						"Общие", 		ПеречисленияТипы.Роль, 							5);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "ОбщийРеквизит",				"ОбщиеРеквизиты", 				"Общие", 		ПеречисленияТипы.ОбщийРеквизит, 				6);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "ПланОбмена",					"ПланыОбмена", 					"Общие", 		ПеречисленияТипы.ПланОбмена, 					7);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "КритерийОтбора",				"КритерииОтбора", 				"Общие", 		ПеречисленияТипы.КритерийОтбора, 				8);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "ПодпискаНаСобытие",			"ПодпискиНаСобытия",			"Общие",		ПеречисленияТипы.ПодпискаНаСобытия,				9);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "РегламентноеЗадание",			"РегламентныеЗадания", 			"Общие", 		ПеречисленияТипы.РегламентноеЗадание, 			10);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "ФункциональнаяОпция",			"ФункциональныеОпции", 			"Общие", 		ПеречисленияТипы.ФункциональнаяОпция, 			11);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "ПараметрФункциональнойОпции",	"ПараметрыФункциональныхОпций", "Общие", 		ПеречисленияТипы.ПараметрФункциональнойОпции, 	12);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "ОпределяемыйТип", 				"ОпределяемыеТипы", 			"Общие", 		ПеречисленияТипы.ОпределяемыйТип, 				56);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "ХранилищеНастроек", 			"ХранилищаНастроек", 			"Общие", 		ПеречисленияТипы.ХранилищеНастроек, 			13);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "ОбщаяФорма", 					"ОбщиеФормы", 					"Общие", 		ПеречисленияТипы.ОбщаяФорма, 					14);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "ОбщаяУправляемаяФорма", 		"ОбщиеУправляемыеФормы", 		"Общие", 		ПеречисленияТипы.ОбщаяУправляемаяФорма, 		14);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "ОбщаяКоманда", 				"ОбщиеКоманды", 				"Общие", 		ПеречисленияТипы.ОбщаяКоманда, 					15);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "ГруппаКоманд", 				"ГруппыКоманд", 				"Общие", 		ПеречисленияТипы.ГруппаКоманд, 					16);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "Интерфейс", 					"Интерфейсы", 					"Общие", 		ПеречисленияТипы.Интерфейс, 					17);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "ОбщийМакет", 					"ОбщиеМакеты", 					"Общие", 		ПеречисленияТипы.ОбщийМакет, 					58);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "ОбщаяКартинка", 				"ОбщиеКартинки", 				"Общие", 		ПеречисленияТипы.Картинка, 						19);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "ПакетXDTO", 					"ПакетыXDTO", 					"Общие", 		ПеречисленияТипы.ПакетXDTO, 					20);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "WebСервис", 					"WebСервисы", 					"Общие", 		ПеречисленияТипы.WebСервис, 					21);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "WSСсылка", 					"WSСсылки", 					"Общие", 		ПеречисленияТипы.WSСсылка, 						24);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "ЭлементСтиля", 				"ЭлементыСтиля", 				"Общие", 		ПеречисленияТипы.ЭлементСтиля, 					26);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "Стиль", 						"Стили", 						"Общие", 		ПеречисленияТипы.Стиль, 						25);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "Язык", 						"Языки", 						"Общие", 		ПеречисленияТипы.Язык, 							27);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "Константа", 					"Константы", 					"Конфигурация", ПеречисленияТипы.Константа, 					28);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "Справочник", 					"Справочники", 					"Конфигурация", ПеречисленияТипы.Справочник, 					29);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "Документ", 					"Документы", 					"Конфигурация", ПеречисленияТипы.Документ, 						30);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "ЖурналДокументов", 			"ЖурналыДокументов", 			"Конфигурация", ПеречисленияТипы.ЖурналДокументов, 				33);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "Перечисление", 				"Перечисления", 				"Конфигурация", ПеречисленияТипы.Перечисление, 					35);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "Отчет", 						"Отчеты", 						"Конфигурация", ПеречисленияТипы.Отчет, 						37);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "Обработка", 					"Обработки", 					"Конфигурация", ПеречисленияТипы.Обработка, 					38);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "ПланВидовХарактеристик", 		"ПланыВидовХарактеристик", 		"Конфигурация", ПеречисленияТипы.ПланВидовХарактеристик, 		39);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "ПланСчетов", 					"ПланыСчетов", 					"Конфигурация", ПеречисленияТипы.ПланСчетов, 					40);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "ПланВидовРасчета", 			"ПланыВидовРасчета", 			"Конфигурация", ПеречисленияТипы.ПланВидовРасчета, 				43);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "РегистрСведений", 				"РегистрыСведений", 			"Конфигурация", ПеречисленияТипы.РегистрСведений, 				44);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "РегистрНакопления", 			"РегистрыНакопления", 			"Конфигурация", ПеречисленияТипы.РегистрНакопления, 			45);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "РегистрБухгалтерии", 			"РегистрыБухгалтерии", 			"Конфигурация", ПеречисленияТипы.РегистрБухгалтерии, 			46);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "РегистрРасчета", 				"РегистрыРасчета", 				"Конфигурация", ПеречисленияТипы.РегистрРасчета, 				47);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "БизнесПроцесс", 				"БизнесПроцессы", 				"Конфигурация", ПеречисленияТипы.БизнесПроцесс, 				51);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "Задача", 						"Задачи", 						"Конфигурация", ПеречисленияТипы.Задача, 						52);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "ВнешнийИсточникДанных", 		"ВнешниеИсточникиДанных", 		"Конфигурация", ПеречисленияТипы.ПустаяСсылка(), 				54);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "Реквизит", 					"Реквизиты", 					"", 			ПеречисленияТипы.Реквизит, 						56);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "СтандартнаяТабличнаяЧасть",	"СтандартныеТабличныеЧасти", 	"", 			ПеречисленияТипы.СтандартнаяТабличнаяЧасть, 	57);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "СтандартныйРеквизит",			"СтандартныеРеквизиты", 		"", 			ПеречисленияТипы.СтандартныйРеквизит, 			56);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "ТабличнаяЧасть", 				"ТабличныеЧасти", 				"", 			ПеречисленияТипы.ТабличнаяЧасть, 				57);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "ТабличнаяЧасть", 				"ТабличныеЧасти", 				"", 			ПеречисленияТипы.ТабличныеЧасти, 				57);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "Модуль", 						"Модули", 						"", 			ПеречисленияТипы.Модуль, 						58);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "Форма", 						"Формы", 						"", 			ПеречисленияТипы.Форма, 						14);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "Форма", 						"Формы", 						"", 			ПеречисленияТипы.Формы, 						14);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "УправляемаяФорма", 			"УправляемыеФормы", 			"", 			ПеречисленияТипы.УправляемаяФорма, 				14);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "Команда", 						"Команды", 						"", 			ПеречисленияТипы.Команда, 						15);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "Макет", 						"Макеты", 						"", 			ПеречисленияТипы.Макет, 						58);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "Нумератор", 					"Нумераторы", 					"", 			ПеречисленияТипы.ПустаяСсылка(), 				31);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "Последовательность", 			"Последовательности",			"", 			ПеречисленияТипы.ПустаяСсылка(), 				32);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "Графа", 						"Графы", 						"", 			ПеречисленияТипы.Графа, 						34);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "Значение", 					"Значения", 					"", 			ПеречисленияТипы.Значение, 						36);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "ПризнакУчета", 				"ПризнакиУчета", 				"", 			ПеречисленияТипы.ПустаяСсылка(), 				41);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "ПризнакУчетаСубконто", 		"ПризнакиУчетаСубконто", 		"", 			ПеречисленияТипы.ПустаяСсылка(), 				42);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "Измерение", 					"Измерения", 					"", 			ПеречисленияТипы.Измерение, 					48);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "Ресурс", 						"Ресурсы", 						"", 			ПеречисленияТипы.Ресурс, 						49);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "Перерасчет", 					"Перерасчеты", 					"", 			ПеречисленияТипы.ПустаяСсылка(), 				50);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "РеквизитАдресации", 			"РеквизитыАдресации", 			"", 			ПеречисленияТипы.ПустаяСсылка(), 				53);
	ЗаполнитьСтрокуТаблицы(ТипыОбъектов.Добавить(), "ПредопределенныйЭлемент", 		"ПредопределенныеЭлементы", 	"", 			ПеречисленияТипы.ПредопределенныйЭлемент, 		56);
	
	Возврат ТипыОбъектов;
	
КонецФункции


функция ЗаполнитьСтрокуТаблицы(СтрокаТаблицы, Значение0 = Неопределено, Значение1 = Неопределено, Значение2 = Неопределено, Значение3 = Неопределено, Значение4 = Неопределено, Значение5 = Неопределено, Значение6 = Неопределено, Значение7 = Неопределено, Значение8 = Неопределено, Значение9 = Неопределено) Экспорт 
	
	Колонки = СтрокаТаблицы.Владелец().Колонки; 
	
	Для Каждого Колонка из Колонки Цикл 
		ИндексКолонки = Колонки.Индекс(Колонка);
		ЗначениеПоля = Вычислить("Значение"+ИндексКолонки);
		
		СтрокаТаблицы[Колонка.Имя] = ЗначениеПоля;
		
	КонецЦикла;	
	
	Возврат СтрокаТаблицы;
	
КонецФункции
